var sentences = [
 "للتذكير لقد تجاوزت 100% من أيامك الصعبة التي ظننت في وقتها انك لن تستطيع تجاوزها هل اقتنعت انك لست شخص عادي؟ وكل الظروف ضعيفة امامك -علي نجم", 
 "قانون الأجمل لراحة البال: لا تتوقع أي شيء من أي احد لا تضغط على نفسك و نفسيتك!-علي نجم",
 "لا تعاند نفسك اذا فيه شعور بقلبك ودك تعيشه أو تعبر عنه لا تحسبه بقلبك اذا في طموح وحلم بخاطرك تحققه لا تفكر بأي شخص قالك انك ما تقدر غامر عيش واطلق العنان لروحك و انت لك نصيب من الأشياء الحلوة-علي نجم",
 "لو قُدّر عليك أمر ما، مهمة أو معضلة، ووجدتها صعبة.. فاسألِ الله حبها، الحب يوسع طاقة التحمل، يجعلنا نبذل لِمَا نقدر حتى لا نقدر، ثم نقبل الأمور كما هي عليه. وبعدها نرضى بخيرةِ الله. ",
 "أيقنت أن القلق لن يغير من الأمر شيء، ولكن الثقة بالله تغير كل شيء",
 "لا تخف من محاولاتك المستمرة خاف من أنك توقف المحاولة – علي نجم",
 "لا تكثر من الشكوى فيأتيك الهم، ولكن أكثِر من الحمد تأتيك السعادة. -علي بن أبي طالب",
 "هذا الصبر سيثمر، تماسك، يقول عمر بن عبدالعزيز ما أنعم الله على عبدٍ نعمةً فانتزعها منه فعاضهُ مكانها الصبر، إلا كان ما عوضه.. خيرًا مما انتزعه!",
 "على الإنسان أن يتقبل نفسه كما يراها هو، وأن يحب نفسه على حالتها -إبراهيم فقي",
 "بدلاً من أن تنظر للناس وكأنهم يهاجمونك، أنظر اليهم كخائفين يلتمسون منك العون والحب- إبراهيم فقي", 
 "هناك أوقات نشعر فيها أنها النهاية ثم نكتشف أنها البداية وهناك أبواب نشعر بأنها مغلقة ثم نكتشف أنها المدخل الحقيقي¬- إبراهيم فقي",
 "كخطوة أولى للسعادة والتفكير الجاد، عليك أن تتخلص من احساسك بأنك الضحية- إبراهيم فقي",
 "حياتك عبارة عن طريقة تفكيرك كل ما كنت انسان قوي مبتسم وقلبك مفتوح لكل شيء  راح تلاقي حياتك تشبهك-علي نجم",
 "لأنك تستحق السعادة، يجب أن تؤمن بأن لا قيمة في معاقبة نفسك- إبراهيم فقي",
 "الهوايات لها قوة علاجية رائعة، فهي تبعدك عن ضغوط الحياة اليومية وتأخذك الى الراحة والسعادة-إبراهيم فقي",
 "لا تنتظر السعادة لتبتسم.. ابتسم لـترى السعادة- إبراهيم فقي",
 "لولا وجود عكس المعنى لما كان للمعنى معنى -إبراهيم فقي",
 "مزاجك و راحة بالك قلبك لازم يكونون اهم ثلاث أولويات عندك ابتداءً من اليوم اتقفنا ؟-علي نجم",
 "عندما نلوم الآخرين نصبح ضحاياهم، ونبرر تصرفاتنا اتجاههم، ونعطيهم جزء من لحظات حياتنا التي من الممكن أن تكون الأخيرة-إبراهيم فقي",
 "لا تحزن إذا جاءك سهم قاتل من أقرب الناس إلى قلبك.. فسوف تجد من ينزع السهم ويعيد إليك الحياة و الابتسامة-إبراهيم فقي",
 "ربٌ الخير لا يأتي إلا بالخير",
 "(وَمَا تَفْعَلُوا مِنْ خَيْرٍ فَإِنَّ اللَّهَ بِهِ عَلِيمٌ) سورة البقرة ",
 "دع الأمل يعمر قلبك ولو لم تر الضوء",
 "يا بني.. عوَد لسانك: اللهم اغفر لي فإن لله ساعات لا يرد فيها سائلاً", 
 "ذكَر نفسك أنه لا بأس في ألا تكون مثالياً",
 "من دعاء النبي صلى الله عليه وسلم (اللهم أسألك قلباً سليما)",
 "في اللحظة التي تخشى من وقوع قلبك انهزاما من هذه الحياة لا تنسى بأن الله قريبٌ منك للحد الذي يجعلك صلبا لا تكسرك حياة",
 "(سَلَامٌ عَلَيْكُم بِمَا صَبَرْتُمْ) سورة الرعد",
 "لك عند الله خيرًا يؤجله، حتى تتهيأ ظروفك لاستقباله، فلا تظنه ناسيك إن تأخر. لقد استجاب، ولكنه يهيّئ لَكَ الأسباب.. فصبرًا جميل",
 "المثالية والنزعة الكمالية لصان.. يسرقان منك السلام الداخلي والتصالح مع الذات وقبولك لنفسك",
 "دايماً تذكر نظرتك لنفسك اهم بمليون مرة من وشلون ممكن غيرك يشوفك أو شنو ممكن يفكر فيك- علي نجم",
 "اسمح لنفسك أن تفعل الأشياء والعادات الجديدة بشكل غير كامل، ناقص، وغير دقيق، اسمح لنفسك بالتجربة والفشل، هذه هي الحياة",
 "نت لا تكافئ الآخرين بمسامحتك لهم، وغفران أخطائهم و زلاتهم. أنت تكافئ نفسك أولًا، وتتطهّر من الداخل",
 "ليست كل العواصف يبعثها الله لتوقف حياتك، فالكثير منها يأتي لتمهيد الطريق.. والوصول بك لأفضل مما كنت تتخيل", 
 "قال التابعي سعيد بن جبير: إن أول من يدعى إلى الجنة، الذين يحمدون الله على كل حال، أو كما قال: يحمدون الله في السراء والضراء. اللهم لك الحمد والشكر والفضل والمنة",
 "(أَيَحْسَبُ الإنْسَانُ أَنْ يُتْرَكَ سُدًى) سورة القيامة",
 "لك كامل الحق تكون مزاجي احياناً لا تعطي غيرك اكثر مما تعطي نفسك لك الحق عليك لا تنسى -علي نجم",
 "إن الله ليُكره عبده على البلاء كما يُكره أهل المريض مريضهم، وأهل الصبي صبيهم على الدواء، ويقولون: اشرب هذا؛ فإن لك في عاقبته خيرًا. -عون بن عتبة",
 "ما لا يدركونه هو ان تلك الخطوات الصغيرة التي تبدو بلا قيمة عند إنجازها ، مع مرور الوقت ستحدث اختلافاً جذرياً جون ماكسيويل",
 "تطمن ماكو شيء حلو تسويه الا ويرجع لك تطمن قلبك الصافي راح يلقى اللي يسره-علي نجم",
 "الألم العظيم يصنع الشخص العظيم ، لا تجزع ولا تبتئس من زيارة الأزمات (فهي تقويك وتجعلك أكثر صلابة)",
 "عاشروا الناس مُعاشرة إنْ عِشتُم حنُّوا إليكم، وإن مِتُّم بَكوا عليكم المحاسن والأضداد-الجاحظ",
 "(وَإِن يُرِدكَ بِخَيرٍ فَلا رادَّ لِفَضلِهِ يُصيبُ بِهِ مَن يَشاءُ مِن عِبادِهِ وَهُوَ الغَفورُ الرَّحيم)",
 "معظم ما نخشاه من تضخيم عقلنا ",
 "الى قلبك لا تندفع بزيادة عن اللزوم ! انتبه للتفاصيل الصغيرة ولا تعلق نفسك بأمل باطل -علي نجم",
 "ترفّع ..اذا كان الانسان يعرف بأصدقائه فإنه أيضاً يُعرف بأعدائه البعض لا يستحقون شرف أن تعاديهم ",
 "وأنت على طريق الحياة تجرد من الدهشة وهيئ نفسك لكل مفاجئات الطريق ",
 "البطل هو الشخص الذي ينهض على قدمية حتى وهو عاجز عن ذلك -جاك ديمبسي", 
 "من حق الآخرين أخذ راحتهم، ولكن لا تسمح لهم بأخذ راحتك",
 "إن تعاطفك مع الاخرين شيء جميل لكنه قد يتحول دون أن تدري الى فجوة تمتص من خلالها مآسي الاخرين -فهد الأحمدي",
 "لا شيء يهدر الجسم مثل القلق ومن له إيمان بالله يجب ان يخجل من قلقه على اي شيء-خالد اليافعي",
 "اقض حياتك في الارتقاء بالناس لأعلى، وليس التقليل من شأنهم. الإساءة الى الناس عادة بغيضة أياً كان وضعك-جاكسون براون",
 "نحن في نهاية المطاف مسؤولون عن أنفسنا علينا ألا ننسى من نحن، وألا نشكك بأنفسنا إذا ما رفض شخص ما الاعتراف بنا ",
 "تخيّل النهاية السعيدة أو الحل لمُشكلتك ، اشعر ببهجة الإنجاز وما تتخيّله وتشعره سيقبله عقلك الباطن ويشرع في تحقيقه",
 "تذكّر أنّ لديك القدرة على الاختيار ، فلتختر الحياة والحُب-جوزيف ميرفي",
 "ليس من إنسان عظيم دون امتحان عظيم وليس من إنسان عظيم دون ألم عظيم  -صالح الخزيم",
 "امنح نفسك إمكانية أن تكون يوماً بخير ويوماً اخر بمزاج عكر، تقبل حقيقة أن لا يكون كل شيء كاملاً واسعَ لتغيير مالا يعجبك إيجابياً",
 "إن العقل كالضمير يشبهان عضلة اذا لم نستعملها تضعف شيئا فشيئا-جوستاين غاردر", 
 "التغيير الذي تنتظره هو الذي ينتظرك ، ابدأ بخطوات صغيرة نحو التخلص من كل ما يحزنك، احضن قلبك وكن بخير -عائشة العمران",
 "ﻋﻨﺪﻣﺎ ﻳﺘﺤﺪﺙ ﺍﻟﻨﺎﺱ ﻋﻨﻚ ﺑﺴـﻮﺀ ﻭأﻧﺖ ﺗﻌﻠﻢ أﻧﻚ ﻟﻢ تخطئ ﻓﻲ ﺣﻖ ﺃﺣﺪ ﻣﻨﻬﻢ  ﺗﺬﻛﺮ ﺃﻥ ﺗﺤﻤﺪ الله ﺍﻟﺬﻱ أﺷﻐﻠﻬﻢ ﺑﻚ ﻭﻟﻢ ﻳﺸﻐلك ﺑﻬﻢ - مصطفى محمود",
 "لا تعطي أكثر ولا أقل، بادل كل شخص بمقدار ما يبادلك، حتى لا تستنفذ نفسك",
 "حافظ على كرامتك، حتى لو كلّفكَ الأمر أن تصبح صديقاً لجدران غرفتك",
 "لم يخلق قلبك للذبول، عود نفسك أن تزهر دائماً، مهما بهتت الحياة في عيناك",
 "اقترِب من كلّ الأشياءِ التي تشعُر أنَّها ستُسعدك. وتشبّث بكلّ من يطبعُ في قلبكَ فرحًا.. كافح لأجلِ ما تُحب",
 "حينما تتمنى حلماً دعه يُشرق في دعواتك ويبقى نابضاً في قلبك.. حتى يتحقق",
 "التدقيق في أتفه التصرفات، قد يهوي بك إلى الجنون .. لذا، تغافل مرة .. وتغابى مرتين",
 "فليس للقلب أنفعُ من معاملة الناس باللطف ، وحب الخير لهم-ابن القيم",
 "لا تستسلم ؛ كلما تعثّرت انهض، وكلما أخطأت صحّح، وكلما فشلت حاول، وكلما أصرّت الأيام على أن تجعلك عابساً ابتسم رغماً عنها", 
 "حقيقة الأشخاص حولنا لا يعلمها إلا اللّه.. لذلك قل دائمًا اللهُم دلّني على من أراد بي خيرًا ودلّه علي، واصرفني عن من أراد بي شرًا وأصرفه عني",
 "ظننت القوة في المواجهة فقط .. فاتضح أنّها في التجاهل أَحياناً-مصطفى محمود",
 "حقيقة الأشخاص حولنا لا يعلمها إلا اللّه؛ لذلك قل دائمًا اللهُم دلّني على من أراد بي خيرًا ودلّه علي، واصرفني عن من أراد بي شرًا وأصرفه عني",
 "إذا قرأت: (أليس الله بكاف عبده )  فكل المخاوف تتبدد وإذا قرأت: ( ادعوني استجب لكم ) فكل الأحلام تتجدد",
 "لا تدع جَهْل الناس بك يغلب علمك بنفسك-الإمام علي بن أبي طالب",
 "لا أحد يعرفنا حقًا، لأنهُ ثمة دائمًا ما ليس بوسعنا أن نُظهره",
 "عاهد نفسك أن لا تنحني لأحد، وأن لا تخضع لأحد، وأن لا يؤرِّق بالك شخص ولا يقتل حُلمك بؤس وأن لا ينتصر عليك يأس، وأن تُقدِّر نفسك حق تقدير ",
 "من ظَلم ظُلم، ومن كَسر كُسر، ومن خَان سيُخان، لا ينسى الله و داين تُدان",
 "(الَّذِي خَلَقَنِي فَهُوَ يَهْدِينِ)",
 "(يُرِيدُ اللّهُ أَن يُخَفِّفَ عَنكُمْ وَخُلِقَ الإِنسَانُ ضَعِيفاً ("
]

var button = document.getElementById("clickme");
var p = document.getElementById("click");
var paragraph = document.createElement("p");
var text = document.createTextNode("استمر في النقر لمزيد من السعادة");
paragraph.appendChild(text);

var but = function(){
  var random = sentences[Math.floor(Math.random()*sentences.length)];
  button.style.backgroundColor = "rgba(255,255,255,0.2)";
  button.style.border = "3px solid #1b262c";
  button.style.height = "8em";
  button.style.width = "25em";
  p.textContent = "أنت مرحب بك ️دائماً";

  p.style.color = "white";
  p.style.fontSize = "2em";
  p.style.marginTop = ".7em";
  p.appendChild(paragraph);
  paragraph.className = "styleParagraph";
  message.textContent = random;
  message.style.color = "white";
  backg.style.backgroundColor = "#f0ece3";
}

button.addEventListener("click", but);